EDT/УТ/src/InformationRegisters/зпМинимальныеСтавки/зпМинимальныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпМинимальныеСтавки</name>
  <resources>
    <name>МинимальнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМинимальнойСтавки</name>
    <type>
      <types>EnumRef.зпВидыМинимальныхСтавок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкОтработанныхДней</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПроцентаВыполнения</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БрейкМинимальногоПробегаПоРейсу</name>
    <type>
      <types>CatalogRef.зпБрейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/зпВидыМинимальныхСтавок/зпВидыМинимальныхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыМинимальныхСтавок</name>
  <enumValues>
    <name>ЗаДень</name>
  </enumValues>
  <enumValues>
    <name>ЗаМесяц</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/InformationRegisters/зпМинимальныеСтавки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТарифРасчетаЗП = Запись.ТарифРасчетаЗП;
	
	СхемаБрейковОтработанныхДней = ТарифРасчетаЗП.СхемаБрейковОтработанныхДней;
	СхемаБрейковПроцентаВыполненияЗаказов = ТарифРасчетаЗП.СхемаБрейковПроцентаВыполненияЗаказов;
	СхемаБрейковПробегаПоРейсу = ТарифРасчетаЗП.СхемаБрейковПробегаПоРейсу;
	
	ВидМинимальнойСтавкиПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВидМинимальнойСтавкиПриИзмененииНаСервере(Изменение = Истина)
	
	Если Запись.ВидМинимальнойСтавки = Перечисления.зпВидыМинимальныхСтавок.ЗаДень Тогда
		Если Изменение Тогда
			Запись.БрейкОтработанныхДней = Неопределено;
		КонецЕсли;
		Элементы.БрейкОтработанныхДней.Доступность = Ложь;
		Элементы.ВидДня.Доступность = Истина;
	ИначеЕсли Запись.ВидМинимальнойСтавки = Перечисления.зпВидыМинимальныхСтавок.ЗаМесяц Тогда
		Если Изменение Тогда
			Запись.ВидДня = Неопределено;
		КонецЕсли;
		Элементы.ВидДня.Доступность = Ложь;
		Элементы.БрейкОтработанныхДней.Доступность = Истина;
	Иначе
		Если Изменение Тогда
			Запись.БрейкОтработанныхДней = Неопределено;
			Запись.ВидДня = Неопределено;
		КонецЕсли;
		Элементы.БрейкОтработанныхДней.Доступность = Ложь;
		Элементы.ВидДня.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидМинимальнойСтавкиПриИзменении(Элемент)
	ВидМинимальнойСтавкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Должность.Пустая() Тогда
		Запись.Должность = Запись.Роль;
	КонецЕсли;
	
КонецПроцедуры
